results/saturate_ssd/cockroachdb/cockroachdb_noslowminthroughput_disk_swapoff_results/exp1_trial_1.txt
Adding shard node URL: jdbc:postgresql://10.0.0.18:26257/ycsb?sslmode=disable
Adding shard node URL: jdbc:postgresql://10.0.0.18:26257/ycsb?sslmode=disable
Adding shard node URL: jdbc:postgresql://10.0.0.18:26257/ycsb?sslmode=disable
[...]
Using shards: 1, batchSize:-1, fetchSize: -1
Using shards: 1, batchSize:-1, fetchSize: -1
Using shards: 1, batchSize:-1, fetchSize: -1
[...]
[OVERALL], RunTime(ms), 302926
[OVERALL], Throughput(ops/sec), 530.5058000963932
[TOTAL_GCS_Copy], Count, 15
[TOTAL_GC_TIME_Copy], Time(ms), 113
[TOTAL_GC_TIME_%_Copy], Time(%), 0.03730283963740319
[TOTAL_GCS_MarkSweepCompact], Count, 0
[TOTAL_GC_TIME_MarkSweepCompact], Time(ms), 0
[TOTAL_GC_TIME_%_MarkSweepCompact], Time(%), 0.0
[TOTAL_GCs], Count, 15
[TOTAL_GC_TIME], Time(ms), 113
[TOTAL_GC_TIME_%], Time(%), 0.03730283963740319
[CLEANUP], Operations, 256
[CLEANUP], AverageLatency(us), 75.65625
[CLEANUP], MinLatency(us), 35
[CLEANUP], MaxLatency(us), 390
[CLEANUP], 99thPercentileLatency(us), 209
[CLEANUP], 99.9PercentileLatency(us), 390
[UPDATE], Operations, 160704
[UPDATE], AverageLatency(us), 477410.2293409
[UPDATE], MinLatency(us), 3062
[UPDATE], MaxLatency(us), 285212671
[UPDATE], 99thPercentileLatency(us), 2484223
[UPDATE], 99.9PercentileLatency(us), 72876031
[UPDATE], Return=OK, 160704