results/saturate_ssd/cockroachdb/cockroachdb_noslowminthroughput_disk_swapoff_results/exp1_trial_2.txt
Adding shard node URL: jdbc:postgresql://10.0.0.18:26257/ycsb?sslmode=disable
Adding shard node URL: jdbc:postgresql://10.0.0.18:26257/ycsb?sslmode=disable
Adding shard node URL: jdbc:postgresql://10.0.0.18:26257/ycsb?sslmode=disable
[...]
Using shards: 1, batchSize:-1, fetchSize: -1
Using shards: 1, batchSize:-1, fetchSize: -1
Using shards: 1, batchSize:-1, fetchSize: -1
[...]
[OVERALL], RunTime(ms), 300890
[OVERALL], Throughput(ops/sec), 649.2937618398751
[TOTAL_GCS_Copy], Count, 16
[TOTAL_GC_TIME_Copy], Time(ms), 114
[TOTAL_GC_TIME_%_Copy], Time(%), 0.03788760011964505
[TOTAL_GCS_MarkSweepCompact], Count, 0
[TOTAL_GC_TIME_MarkSweepCompact], Time(ms), 0
[TOTAL_GC_TIME_%_MarkSweepCompact], Time(%), 0.0
[TOTAL_GCs], Count, 16
[TOTAL_GC_TIME], Time(ms), 114
[TOTAL_GC_TIME_%], Time(%), 0.03788760011964505
[CLEANUP], Operations, 256
[CLEANUP], AverageLatency(us), 64.86328125
[CLEANUP], MinLatency(us), 33
[CLEANUP], MaxLatency(us), 337
[CLEANUP], 99thPercentileLatency(us), 186
[CLEANUP], 99.9PercentileLatency(us), 337
[UPDATE], Operations, 195366
[UPDATE], AverageLatency(us), 392054.10300666443
[UPDATE], MinLatency(us), 29408
[UPDATE], MaxLatency(us), 51609599
[UPDATE], 99thPercentileLatency(us), 1759231
[UPDATE], 99.9PercentileLatency(us), 14491647
[UPDATE], Return=OK, 195366